app/controllers/photos_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 0]]
SELECT "votes".* FROM "votes" WHERE "votes"."photo_id" = $1  [["photo_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."photo_id" = $1  [["photo_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."photo_id" = $1 AND "votes"."like" = $2  [["photo_id", 1], ["like", "t"]]
---
  def show
    photo = Photo.find(params[:id])
    vote = Vote.where(photo_id: params[:id])
    vote_count = vote.count
    like_votes = vote.where(:like => true).count